Revit 2024 API
ConduitSizeSettingIterator Class
 An iterator to a set of items from ConduitSizeSettings. Each item is a KeyValuePair(System::String^, ConduitSizes). ElementId is the id of the conduit standard type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class ConduitSizeSettingIterator : IEnumerator<KeyValuePair<string, ConduitSizes>>
Visual Basic
Public Class ConduitSizeSettingIterator _
	Implements IEnumerator(Of KeyValuePair(Of String, ConduitSizes))
Visual C++
public ref class ConduitSizeSettingIterator : IEnumerator<KeyValuePair<String^, ConduitSizes^>>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator
See Also
ConduitSizeSettingIterator Members
Autodesk.Revit.DB.Electrical Namespace